document.querySelector('Title').text = "Светлана Алексиевич";

document.querySelector('.first, .nav_link').text = "Главная страница";
document.querySelector('.nav_link:nth-of-type(2)').text = "Список писателей";

document.querySelector('.blockDescript p').innerHTML = "Светла́на Алекса́ндровна Алексие́вич (белор. Святлана Аляксандраўна Алексіевіч, род. 31 мая 1948 года, Станислав, Украинская ССР, СССР) — советская и белорусская писательница, журналистка, сценарист документальных фильмов. Пишет на русском языке. Первый белорусский и шестой русскоязычный лауреат Нобелевской премии по литературе (2015 год).<br>Наибольшую известность получили её книги в жанре художественно-документальной прозы «У войны не женское лицо», «Цинковые мальчики», «Чернобыльская молитва», «Время секонд хэнд».\n";

document.querySelector('.events a').text = "31 мая 1948 года";

document.querySelector('li h2').innerHTML = "Рождение поэта";
document.querySelector('li:nth-of-type(2) h2').innerHTML = "Первая книга";
document.querySelector('li:nth-of-type(3) h2').innerHTML = "Вторая книга";
document.querySelector('li:nth-of-type(4) h2').innerHTML = "Третья книга";
document.querySelector('li:nth-of-type(5) h2').innerHTML = "Претендент на Нобелевскую примию";
document.querySelector('li:nth-of-type(6) h2').innerHTML = "Нобелевская примия";

document.querySelector('li em').innerHTML = "31 мая 1948 года";
document.querySelector('li:nth-of-type(2) em').innerHTML = "1983 год";
document.querySelector('li:nth-of-type(3) em').innerHTML = "1985 год";
document.querySelector('li:nth-of-type(4) em').innerHTML = "1989 год";
document.querySelector('li:nth-of-type(5) em').innerHTML = "2013 год";
document.querySelector('li:nth-of-type(6) em').innerHTML = "2015 год";

document.querySelector('li p').innerHTML = "Родилась 31 мая 1948 года в Станиславе. Отец — белорус, мать — украинка из Галиции. После демобилизации отца семья переехала в Минск, отец и мать работали сельскими учителями. Мать отца умерла от тифа в партизанах, из троих её сыновей двое пропали без вести, а отец вернулся с фронта. Отец матери погиб на фронте. Прадед отца тоже был сельским учителем. По её словам, всё своё детство провела в украинском селе, в Винницкой области.\n";
document.querySelector('li:nth-of-type(2) p').innerHTML = "Первая опубликованная книга Алексиевич, «У войны не женское лицо», была написана в 1983 году. Эта документальная повесть, основанная на интервью с советскими женщинами, участвовавшими в Великой Отечественной войне, была впервые опубликована в журнале «Октябрь» в начале 1984 года (в журнальном варианте), ещё несколько глав вышли в том же году в журнале «Нёман».";
document.querySelector('li:nth-of-type(3) p').innerHTML = "Вторая книга писательницы, «Последние свидетели: книга недетских рассказов» (1985, в последующих изданиях использовались варианты подзаголовка «Соло для детского голоса», «Сто недетских колыбельных», «100 недетских рассказов») основана на воспоминаниях детей, которым во время Великой отечественной войны было от шести до двенадцати лет. Это свидетельства «невозможности пережить память травмы».";
document.querySelector('li:nth-of-type(4) p').innerHTML = "Третья книга, «Цинковые мальчики» (1989), посвящена Афганской войне и названа так потому, что тела погибших солдат доставлялись на родину в цинковых гробах. Основанием для книги стали интервью с матерями погибших солдат, а также с вернувшимися с войны участниками афганской кампании.";
document.querySelector('li:nth-of-type(5) p').innerHTML = "В 2013 году Светлана Алексиевич считалась одним из претендентов на Нобелевскую премию по литературе, однако премию получила канадская писательница Элис Манро.";
document.querySelector('li:nth-of-type(6) p').innerHTML = "В 2015 году Алексиевич стала лауреатом Нобелевской премии по литературе с формулировкой «за её многоголосное творчество — памятник страданию и мужеству в наше время». Светлана Алексиевич — первый нобелевский лауреат в истории независимой Белоруссии; она стала первым с 1987 года русскоязычным писателем, удостоенным Нобелевской премии по литературе. Впервые за полвека премия была присуждена писателю, преимущественно работающему в жанре документальной литературы; при этом впервые в истории Нобелевская премия по литературе присуждена профессиональному журналисту. Денежный приз премии составил 8 млн шведских крон (около 953 тыс. долларов на момент присуждения).";

document.querySelector('.iFrame p').innerHTML = "Карта деятельности Алексиевич";


