document.querySelector('Title').text = "Якуб Колас";

document.querySelector('.first, .nav_link').text = "Главная страница";
document.querySelector('.nav_link:nth-of-type(2)').text = "Список писателей";

document.querySelector('.blockDescript p').innerHTML = "Яку́б Ко́лас (настоящее имя и фамилия Константи́н Миха́йлович Мицке́вич, белор. Канстанцін Міхайлавіч Міцкевіч; 22 октября (3 ноября) 1882 — 13 августа 1956) — белорусский советский писатель, драматург, поэт и переводчик, общественный деятель. Один из классиков и основоположников новой белорусской литературы. Народный поэт Белорусской ССР (1926). Академик АН Белорусской ССР (1928). Член СП СССР (1934). Заслуженный деятель науки Белорусской ССР (1944). Член ВКП(б) с 1945 года.";

document.querySelector('.events a').text = "22 октября\n1882года";

document.querySelector('li h2').innerHTML = "Новое светило белорусской литературы";
document.querySelector('li:nth-of-type(2) h2').innerHTML = "Начало творчества";
document.querySelector('li:nth-of-type(3) h2').innerHTML = "Двадцатые года";
document.querySelector('li:nth-of-type(4) h2').innerHTML = "Тридцатые года";
document.querySelector('li:nth-of-type(5) h2').innerHTML = "Военные года";

document.querySelector('li em').innerHTML = "22 октября 1882 года";
document.querySelector('li:nth-of-type(2) em').innerHTML = "1908-1914";
document.querySelector('li:nth-of-type(3) em').innerHTML = "1921-1928";
document.querySelector('li:nth-of-type(4) em').innerHTML = "1930-1935";
document.querySelector('li:nth-of-type(5) em').innerHTML = "1942-1947";

document.querySelector('li p').innerHTML = "Яку́б Ко́лас (настоящее имя и фамилия Константи́н Миха́йлович Мицке́вич) родился 22 октября (3 ноября) 1882 года в Акинчицах – маленькой деревне в Столбовщине, где его отец работал лесником. Через год после рождения маленького Кости семья переехала в Ласток. Там сыновья поступили на обучение к Алесю Фурсевичу, привившему им первоначальные навыки чтения и письма.";
document.querySelector('li:nth-of-type(2) p').innerHTML = "До Октябрьской революции вышли сборники стихов «Песни неволи» (1908), «Песни печали» (1910), отдельные главы эпической поэмы «Новая земля», а также сборники прозы «Рассказы» (1912), «Родные образы» (1914).";
document.querySelector('li:nth-of-type(3) p').innerHTML = "В двадцатых годах XX века были опубликованы поэмы «Новая земля» (1923), «Сымон-музыкант» (1925), повести «В полесской глуши» (1922), «В глубине Полесья» (1928), «На просторах жизни» (1926), отдельные лирические стихотворения, пьесы.\n" +
    "Было начато написание трилогии «На росстанях» («В полесской глуши» (1923); «В глубине Полесья» (1927); «На перепутье», (1954)), работа над которой была начата в 1921 году, повествует о дореволюционной жизни белорусского крестьянства и народной интеллигенции.";
document.querySelector('li:nth-of-type(4) p').innerHTML = "В тридцатых годах написаны циклы стихов «Колхозное» (1930), «Осеннее» (1935), повесть «Отщепенец» (1930—1931). События революции и гражданской войны отражены в повести «Трясина» («Дрыгва», 1933).";
document.querySelector('li:nth-of-type(5) p').innerHTML = "В сборниках стихотворений «Отомстим» (1942) и «Голос земли» (1943), в поэмах «Суд в лесу» (1943) и «Возмездие» (1945) поэт прославляет стойкость белорусского народа, подвиги партизан, выражает уверенность в победе над фашистскими захватчиками. Поэма «Рыбакова хата» (1947) посвящена борьбе белорусского народа за воссоединение Западной Белоруссии с Белорусской ССР.";

document.querySelector('.iFrame p').innerHTML = "Карта деятельности Коласа";
