document.querySelector('Title').text = "Yanka Kupala";

document.querySelector('.first, .nav_link').text = "Главная страница";
document.querySelector('.nav_link:nth-of-type(2)').text = "Список писателей";

document.querySelector('.blockDescript p').innerHTML = "Янка Кучала (истинное имя Ветлан Доминикович Луцевич, белор. ван Дамнкавч Луцэвч; 25 июня (7 июля) 1882  28 июня 1942)  белорусский поэт и переводчик, драматург, публицист.<br>Классик белорусской литературы. Народный поэт БССР (1925). Академик АН БССР (1928) и АН УССР (1929). Родился 25 июня (7 июля) 1882 года в деревне Вязынка (нынче Молодечненского района Минской области Беларуси) в семье Доминика Онуфриевича Луцевича и Бенигны Ивановны Луцевич (дев. Волосевич).";

document.querySelector('.events a').text = "25 июня 1882год";

document.querySelector('li h2').innerHTML = "Рождение поэта";
document.querySelector('li:nth-of-type(2) h2').innerHTML = "Переводческая деятельность";
document.querySelector('li:nth-of-type(3) h2').innerHTML = "В 1925 был удостоен звания народного поэта БССР";
document.querySelector('li:nth-of-type(4) h2').innerHTML = "В 1928 был удостоен звания академика АН БССР";
document.querySelector('li:nth-of-type(5) h2').innerHTML = "В 1929 был удостоен звания академика АН УССР";
document.querySelector('li:nth-of-type(6) h2').innerHTML = "В 1941 стал лауреатом Сталинской премии первой степени";
document.querySelector('li:nth-of-type(7) h2').innerHTML = "В 2003 году завершено издание полного собрания произведений Янки Купалы в 9 томах.";

document.querySelector('li em').innerHTML = "25 июня 1882 года";

document.querySelector('li p').innerHTML = "Родился 25 июня 1882 года в деревне Вязынка, в Минской области, в бедной семье белорусских шляхтичей.\n" +
    "Предки были оскудевшие белорусские шляхтичи, арендовавшие земли в помещичьих угодьях. Род Луцевичей известен с начала семнадцатого века. Дед стихотворца арендовал землю у Радзивиллов, но был ими изгнан с родных мест. Этот факт лёг в основу купаловской драмы Раскданае гняздо.\n" +
    "В детстве будущему стихотворцу приходилось много подсоблять папе, который, несмотря на своё шляхетское происхождение, по сути принадлежал к числу безземельных крестьян и принуждён был обрабатывать съёмные участки (у Здзеховских и др.), платя большие суммы в качестве аренды за внедрение угодий.\n" +
    "После смерти отца в 1902 году, Иван был вынужден работать учителем и писарем в библиотеке. Позже он работал на винокуренном заводе, а в 1908-1909 годах - в Вильненской газете \"Наша Нiва\".\n" +
    "С 1909 по 1915 учился в Москве и Санкт - Петербурге. Позже был мобилизован в связи с началом Первой Мировой.";
document.querySelector('li:nth-of-type(2) p').innerHTML = "Янка Купала занимался и активной переводческой деятельностью. В частности, им в 1919 году на белорусский язык переведено древнерусский памятник «Слово о полку Игореве», ставший первым литературным переводом на белорусский язык.\n" +
    "Занимался другими переводами: поэмы А. С. Пушкина «Медный всадник», ряда стихотворений и поэм Т. Г. Шевченко, некоторые произведения Н. А. Некрасова, И. А. Крылова, А. В. Кольцова, А. Мицкевича, Владислава Сырокомли, М. Конопницкой, Ю. И. Крашевского, В. Броневского, Е. Жулавского и других знаковых поэтов прошлых эпох.\n" +
    "Также перевёл «Интернационал», польский текст в пьесах В. Дунина-Марцинкевича «Идиллия» и «Залёты», либретто оперы «Галька» С. Монюшко.";

document.querySelector('.iFrame p').innerHTML = "Карта деятельности Купалы";
